#!/bin/bash
#定義dns server
dnss[1]=218.2.2.2
dnss[2]=218.4.4.4
dnss[3]=61.147.37.1
dnss[4]=218.2.135.1
dnss[5]=1.2.4.8
dnss[6]=210.2.4.8
dnss[7]=119.29.29.29
dnss[8]=182.254.116.116
dnss[9]=223.5.5.5
dnss[10]=223.6.6.6
dnss[11]=114.114.114.114
dnss[12]=114.114.115.115
dnss[13]=101.226.4.6
dnss[14]=218.30.118.6
dnss[15]=123.125.81.6
dnss[16]=140.207.198.6
dnss[17]=202.103.225.68
dnss[18]=221.7.128.68
dnss[19]=202.103.224.68
dnss[20]=221.7.136.68
dnss[21]=218.85.152.99
dnss[22]=218.85.157.99
#dnss[23]=222.88.88.88
#dnss[24]=222.85.85.85
dnss[25]=202.101.224.69
dnss[26]=202.101.226.68
dnss[27]=61.139.2.69
dnss[28]=218.6.200.139
dnss[29]=219.146.1.66
dnss[30]=219.147.1.66
dnss[31]=202.96.209.133
dnss[32]=116.228.111.118
dnss[33]=202.96.209.5
dnss[34]=108.168.255.118
dnss[35]=61.132.163.68
dnss[36]=202.102.213.68
dnss[37]=202.98.0.68
dnss[38]=202.98.5.68
dnss[39]=61.128.192.68
dnss[40]=61.128.128.68
dnss[41]=219.147.198.230
dnss[42]=219.147.198.242
dnss[43]=219.150.32.132
dnss[44]=219.146.0.132
dnss[45]=202.99.192.66
dnss[46]=202.99.192.68
#1.解析domain name
nslookup unix.stackexchange.com | awk '/^Address: / { print $2 }'
#對照組
nslookup unix.stackexchange.com 8.8.8.8 | awk '/^Address: / { print $2 }'
#23省共46台DNS Server解析結果
for item in "${dnss[@]}"; do
    nslookup $1 $item | awk '/^Address: / { print $2 }'
done
#2.ping該doamin主機
ping -c 5 $1 ; echo "ping測試結果，0為正常：$?"
# 回應逾時時間 (毫秒)
# 為維持每秒一筆記錄, 設定單一檢測目標逾時時間 300 毫秒
# 若需同時檢測更多目標可調低 TIMEOUT 值, 最低 50 毫秒
TIMEOUT=300
# 記錄各檢測目標回應時間
fping -a -c 1 -t $TIMEOUT $1 2>&1 | sed 's/ICMP Host .* sent to \([0-9]\{1,3\}\.\)\{3\}[0-9]\{1,3\}/-1/g' >> $TMPFL
#3.telnet看port有沒有通
echo "80沒開" | nc -w 2 $1 80
echo "443沒開" | nc -w 2 $1 443
#4.
